espressif/esp-idf/components/soc/esp32h21/register/soc/ledc_struct.h
/** Type of timerx_cnt_cap register
 *  Ledc timer x count value capture register.
 */
typedef union {
    struct {
        /** cnt_cap : RO; bitpos: [19:0]; default: 0;
         *  This register stores ledc timer x count value.
         */
        uint32_t cnt_cap:20;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} ledc_timerx_cnt_cap_reg_t;

/** Type of conf register
 *  Global ledc configuration register
 */
typedef union {
    struct {
        /** apb_clk_sel : R/W; bitpos: [1:0]; default: 0;
         *  This bit is used to select clock source for the 4 timers .
         *
         *  2'd1: APB_CLK 2'd2: RTC8M_CLK 2'd3: XTAL_CLK
         */
        uint32_t apb_clk_sel:2;
        /** gamma_ram_clk_en_ch0 : R/W; bitpos: [2]; default: 0;
         *  This bit is used to control clock.
         *
         *  1'b1: Force clock on for gamma ram. 1'h0: Support clock only when application
         *  writes or read gamma ram.
         */
        uint32_t gamma_ram_clk_en_ch0:1;
        /** gamma_ram_clk_en_ch1 : R/W; bitpos: [3]; default: 0;
         *  This bit is used to control clock.
         *
         *  1'b1: Force clock on for gamma ram. 1'h0: Support clock only when application
         *  writes or read gamma ram.
         */
        uint32_t gamma_ram_clk_en_ch1:1;
        /** gamma_ram_clk_en_ch2 : R/W; bitpos: [4]; default: 0;
         *  This bit is used to control clock.
         *
         *  1'b1: Force clock on for gamma ram. 1'h0: Support clock only when application
         *  writes or read gamma ram.
         */
        uint32_t gamma_ram_clk_en_ch2:1;
        /** gamma_ram_clk_en_ch3 : R/W; bitpos: [5]; default: 0;
         *  This bit is used to control clock.
         *
         *  1'b1: Force clock on for gamma ram. 1'h0: Support clock only when application
         *  writes or read gamma ram.
         */
        uint32_t gamma_ram_clk_en_ch3:1;
        /** gamma_ram_clk_en_ch4 : R/W; bitpos: [6]; default: 0;
         *  This bit is used to control clock.
         *
         *  1'b1: Force clock on for gamma ram. 1'h0: Support clock only when application
         *  writes or read gamma ram.
         */
        uint32_t gamma_ram_clk_en_ch4:1;
        /** gamma_ram_clk_en_ch5 : R/W; bitpos: [7]; default: 0;
         *  This bit is used to control clock.
         *
         *  1'b1: Force clock on for gamma ram. 1'h0: Support clock only when application
         *  writes or read gamma ram.
         */
        uint32_t gamma_ram_clk_en_ch5:1;
        uint32_t reserved_8:23;
        /** clk_en : R/W; bitpos: [31]; default: 0;
         *  This bit is used to control clock.
         *
         *  1'b1: Force clock on for register. 1'h0: Support clock only when application writes
         *  registers.
         */
        uint32_t clk_en:1;
    };
    uint32_t val;
} ledc_conf_reg_t;


/** Group: Hpoint Register */
/** Type of chn_hpoint register
 *  High point register for channel n
 */
typedef union {
    struct {
        /** hpoint : R/W; bitpos: [19:0]; default: 0;
         *  The output value changes to high when the selected timers has reached the value
         *  specified by this register.
         */
        uint32_t hpoint:20;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} ledc_chn_hpoint_reg_t;


/** Group: Duty Cycle Register */
/** Type of chn_duty register
 *  Initial duty cycle for channel n
 */
typedef union {
    struct {
        /** duty : R/W; bitpos: [24:0]; default: 0;
         *  This register is used to change the output duty by controlling the Lpoint.
         *
         *  The output value turns to low when the selected timers has reached the Lpoint.
         */
        uint32_t duty:25;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} ledc_chn_duty_reg_t;

/** Type of chn_duty_r register
 *  Current duty cycle for channel n
 */
typedef union {
    struct {
        /** duty_r : RO; bitpos: [24:0]; default: 0;
         *  This register stores the current duty of output signal on channel n.
         */
        uint32_t duty_r:25;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} ledc_chn_duty_r_reg_t;


/** Group: Timer Register */
/** Type of timerx_conf register
 *  Timer x configuration
 */
typedef union {
    struct {
        /** duty_res : R/W; bitpos: [4:0]; default: 0;
         *  This register is used to control the range of the counter in timer x.
         */
        uint32_t duty_res:5;
        /** clk_div : R/W; bitpos: [22:5]; default: 0;
         *  This register is used to configure the divisor for the divider in timer x.
         *
         *  The least significant eight bits represent the fractional part.
         */
        uint32_t clk_div:18;
        /** pause : R/W; bitpos: [23]; default: 0;
         *  This bit is used to suspend the counter in timer x.
         */
        uint32_t pause:1;
        /** rst : R/W; bitpos: [24]; default: 1;
         *  This bit is used to reset timer x. The counter will show 0 after reset.
         */
        uint32_t rst:1;
        uint32_t reserved_25:1;
        /** para_up : WT; bitpos: [26]; default: 0;
         *  Set this bit to update LEDC_CLK_DIV_TIMERn and LEDC_TIMERn_DUTY_RES.
         */
        uint32_t para_up:1;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} ledc_timerx_conf_reg_t;

/** Type of timerx_value register
 *  Timer x current counter value
 */
typedef union {
    struct {
        /** timer_cnt : RO; bitpos: [19:0]; default: 0;
         *  This register stores the current counter value of timer x.
         */
        uint32_t timer_cnt:20;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} ledc_timerx_value_reg_t;


/** Group: Interrupt Register */
/** Type of int_raw register
 *  Raw interrupt status
 */
typedef union {
    struct {
        /** timer0_ovf_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  Triggered when the timer0 has reached its maximum counter value.
         */
        uint32_t timer0_ovf_int_raw:1;
        /** timer1_ovf_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  Triggered when the timer1 has reached its maximum counter value.
         */
        uint32_t timer1_ovf_int_raw:1;
        /** timer2_ovf_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  Triggered when the timer2 has reached its maximum counter value.
         */
        uint32_t timer2_ovf_int_raw:1;
        /** timer3_ovf_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  Triggered when the timer3 has reached its maximum counter value.
         */
        uint32_t timer3_ovf_int_raw:1;
        /** duty_chng_end_ch0_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  Interrupt raw bit for channel 0. Triggered when the gradual change of duty has
         *  finished.
         */
        uint32_t duty_chng_end_ch0_int_raw:1;
        /** duty_chng_end_ch1_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  Interrupt raw bit for channel 1. Triggered when the gradual change of duty has
         *  finished.
         */
        uint32_t duty_chng_end_ch1_int_raw:1;
        /** duty_chng_end_ch2_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  Interrupt raw bit for channel 2. Triggered when the gradual change of duty has
         *  finished.
         */
        uint32_t duty_chng_end_ch2_int_raw:1;
        /** duty_chng_end_ch3_int_raw : R/WTC/SS; bitpos: [7]; default: 0;
         *  Interrupt raw bit for channel 3. Triggered when the gradual change of duty has
         *  finished.
         */
        uint32_t duty_chng_end_ch3_int_raw:1;
        /** duty_chng_end_ch4_int_raw : R/WTC/SS; bitpos: [8]; default: 0;
         *  Interrupt raw bit for channel 4. Triggered when the gradual change of duty has
         *  finished.
         */
        uint32_t duty_chng_end_ch4_int_raw:1;
        /** duty_chng_end_ch5_int_raw : R/WTC/SS; bitpos: [9]; default: 0;
         *  Interrupt raw bit for channel 5. Triggered when the gradual change of duty has
         *  finished.
         */
        uint32_t duty_chng_end_ch5_int_raw:1;
        uint32_t reserved_10:2;
        /** ovf_cnt_ch0_int_raw : R/WTC/SS; bitpos: [12]; default: 0;
         *  Interrupt raw bit for channel 0. Triggered when the ovf_cnt has reached the value
         *  specified by LEDC_OVF_NUM_CH0.
         */
        uint32_t ovf_cnt_ch0_int_raw:1;
        /** ovf_cnt_ch1_int_raw : R/WTC/SS; bitpos: [13]; default: 0;
         *  Interrupt raw bit for channel 1. Triggered when the ovf_cnt has reached the value
         *  specified by LEDC_OVF_NUM_CH1.
         */
        uint32_t ovf_cnt_ch1_int_raw:1;
        /** ovf_cnt_ch2_int_raw : R/WTC/SS; bitpos: [14]; default: 0;
         *  Interrupt raw bit for channel 2. Triggered when the ovf_cnt has reached the value
         *  specified by LEDC_OVF_NUM_CH2.
         */
        uint32_t ovf_cnt_ch2_int_raw:1;
        /** ovf_cnt_ch3_int_raw : R/WTC/SS; bitpos: [15]; default: 0;
         *  Interrupt raw bit for channel 3. Triggered when the ovf_cnt has reached the value
         *  specified by LEDC_OVF_NUM_CH3.
         */
        uint32_t ovf_cnt_ch3_int_raw:1;
        /** ovf_cnt_ch4_int_raw : R/WTC/SS; bitpos: [16]; default: 0;
         *  Interrupt raw bit for channel 4. Triggered when the ovf_cnt has reached the value
         *  specified by LEDC_OVF_NUM_CH4.
         */
        uint32_t ovf_cnt_ch4_int_raw:1;
        /** ovf_cnt_ch5_int_raw : R/WTC/SS; bitpos: [17]; default: 0;
         *  Interrupt raw bit for channel 5. Triggered when the ovf_cnt has reached the value
         *  specified by LEDC_OVF_NUM_CH5.
         */
        uint32_t ovf_cnt_ch5_int_raw:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} ledc_int_raw_reg_t;

/** Type of int_st register
 *  Masked interrupt status
 */
typedef union {
    struct {
        /** timer0_ovf_int_st : RO; bitpos: [0]; default: 0;
         *  This is the masked interrupt status bit for the LEDC_TIMER0_OVF_INT interrupt when
         *  LEDC_TIMER0_OVF_INT_ENA is set to 1.
         */
        uint32_t timer0_ovf_int_st:1;
        /** timer1_ovf_int_st : RO; bitpos: [1]; default: 0;
         *  This is the masked interrupt status bit for the LEDC_TIMER1_OVF_INT interrupt when
         *  LEDC_TIMER1_OVF_INT_ENA is set to 1.
         */
        uint32_t timer1_ovf_int_st:1;
        /** timer2_ovf_int_st : RO; bitpos: [2]; default: 0;
         *  This is the masked interrupt status bit for the LEDC_TIMER2_OVF_INT interrupt when
         *  LEDC_TIMER2_OVF_INT_ENA is set to 1.
         */
        uint32_t timer2_ovf_int_st:1;
        /** timer3_ovf_int_st : RO; bitpos: [3]; default: 0;
         *  This is the masked interrupt status bit for the LEDC_TIMER3_OVF_INT interrupt when
         *  LEDC_TIMER3_OVF_INT_ENA is set to 1.
         */
        uint32_t timer3_ovf_int_st:1;
        /** duty_chng_end_ch0_int_st : RO; bitpos: [4]; default: 0;
         *  This is the masked interrupt status bit for the LEDC_DUTY_CHNG_END_CH0_INT
         *  interrupt when LEDC_DUTY_CHNG_END_CH0_INT_ENA is set to 1.
         */
        uint32_t duty_chng_end_ch0_int_st:1;
        /** duty_chng_end_ch1_int_st : RO; bitpos: [5]; default: 0;
         *  This is the masked interrupt status bit for the LEDC_DUTY_CHNG_END_CH1_INT
         *  interrupt when LEDC_DUTY_CHNG_END_CH1_INT_ENA is set to 1.
         */
        uint32_t duty_chng_end_ch1_int_st:1;
        /** duty_chng_end_ch2_int_st : RO; bitpos: [6]; default: 0;
         *  This is the masked interrupt status bit for the LEDC_DUTY_CHNG_END_CH2_INT
         *  interrupt when LEDC_DUTY_CHNG_END_CH2_INT_ENA is set to 1.
         */
        uint32_t duty_chng_end_ch2_int_st:1;
        /** duty_chng_end_ch3_int_st : RO; bitpos: [7]; default: 0;
         *  This is the masked interrupt status bit for the LEDC_DUTY_CHNG_END_CH3_INT
         *  interrupt when LEDC_DUTY_CHNG_END_CH3_INT_ENA is set to 1.
         */
        uint32_t duty_chng_end_ch3_int_st:1;
        /** duty_chng_end_ch4_int_st : RO; bitpos: [8]; default: 0;
         *  This is the masked interrupt status bit for the LEDC_DUTY_CHNG_END_CH4_INT
         *  interrupt when LEDC_DUTY_CHNG_END_CH4_INT_ENA is set to 1.
         */
        uint32_t duty_chng_end_ch4_int_st:1;
        /** duty_chng_end_ch5_int_st : RO; bitpos: [9]; default: 0;
         *  This is the masked interrupt status bit for the LEDC_DUTY_CHNG_END_CH5_INT
         *  interrupt when LEDC_DUTY_CHNG_END_CH5_INT_ENA is set to 1.
         */
        uint32_t duty_chng_end_ch5_int_st:1;
        uint32_t reserved_10:2;
        /** ovf_cnt_ch0_int_st : RO; bitpos: [12]; default: 0;
         *  This is the masked interrupt status bit for the LEDC_OVF_CNT_CH0_INT interrupt when
         *  LEDC_OVF_CNT_CH0_INT_ENA is set to 1.
         */
        uint32_t ovf_cnt_ch0_int_st:1;
        /** ovf_cnt_ch1_int_st : RO; bitpos: [13]; default: 0;
         *  This is the masked interrupt status bit for the LEDC_OVF_CNT_CH1_INT interrupt when
         *  LEDC_OVF_CNT_CH1_INT_ENA is set to 1.
         */
        uint32_t ovf_cnt_ch1_int_st:1;
        /** ovf_cnt_ch2_int_st : RO; bitpos: [14]; default: 0;
         *  This is the masked interrupt status bit for the LEDC_OVF_CNT_CH2_INT interrupt when
         *  LEDC_OVF_CNT_CH2_INT_ENA is set to 1.
         */
        uint32_t ovf_cnt_ch2_int_st:1;
        /** ovf_cnt_ch3_int_st : RO; bitpos: [15]; default: 0;
         *  This is the masked interrupt status bit for the LEDC_OVF_CNT_CH3_INT interrupt when
         *  LEDC_OVF_CNT_CH3_INT_ENA is set to 1.
         */
        uint32_t ovf_cnt_ch3_int_st:1;
        /** ovf_cnt_ch4_int_st : RO; bitpos: [16]; default: 0;
         *  This is the masked interrupt status bit for the LEDC_OVF_CNT_CH4_INT interrupt when
         *  LEDC_OVF_CNT_CH4_INT_ENA is set to 1.
         */
        uint32_t ovf_cnt_ch4_int_st:1;
        /** ovf_cnt_ch5_int_st : RO; bitpos: [17]; default: 0;
         *  This is the masked interrupt status bit for the LEDC_OVF_CNT_CH5_INT interrupt when
         *  LEDC_OVF_CNT_CH5_INT_ENA is set to 1.
         */
        uint32_t ovf_cnt_ch5_int_st:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} ledc_int_st_reg_t;

/** Type of int_ena register
 *  Interrupt enable bits
 */
typedef union {
    struct {
        /** timer0_ovf_int_ena : R/W; bitpos: [0]; default: 0;
         *  The interrupt enable bit for the LEDC_TIMER0_OVF_INT interrupt.
         */
        uint32_t timer0_ovf_int_ena:1;
        /** timer1_ovf_int_ena : R/W; bitpos: [1]; default: 0;
         *  The interrupt enable bit for the LEDC_TIMER1_OVF_INT interrupt.
         */
        uint32_t timer1_ovf_int_ena:1;
        /** timer2_ovf_int_ena : R/W; bitpos: [2]; default: 0;
         *  The interrupt enable bit for the LEDC_TIMER2_OVF_INT interrupt.
         */
        uint32_t timer2_ovf_int_ena:1;
        /** timer3_ovf_int_ena : R/W; bitpos: [3]; default: 0;
         *  The interrupt enable bit for the LEDC_TIMER3_OVF_INT interrupt.
         */
        uint32_t timer3_ovf_int_ena:1;
        /** duty_chng_end_ch0_int_ena : R/W; bitpos: [4]; default: 0;
         *  The interrupt enable bit for the LEDC_DUTY_CHNG_END_CH0_INT interrupt.
         */
        uint32_t duty_chng_end_ch0_int_ena:1;
        /** duty_chng_end_ch1_int_ena : R/W; bitpos: [5]; default: 0;
         *  The interrupt enable bit for the LEDC_DUTY_CHNG_END_CH1_INT interrupt.
         */
        uint32_t duty_chng_end_ch1_int_ena:1;
        /** duty_chng_end_ch2_int_ena : R/W; bitpos: [6]; default: 0;
         *  The interrupt enable bit for the LEDC_DUTY_CHNG_END_CH2_INT interrupt.
         */
        uint32_t duty_chng_end_ch2_int_ena:1;
        /** duty_chng_end_ch3_int_ena : R/W; bitpos: [7]; default: 0;
         *  The interrupt enable bit for the LEDC_DUTY_CHNG_END_CH3_INT interrupt.
         */
        uint32_t duty_chng_end_ch3_int_ena:1;
        /** duty_chng_end_ch4_int_ena : R/W; bitpos: [8]; default: 0;
         *  The interrupt enable bit for the LEDC_DUTY_CHNG_END_CH4_INT interrupt.
         */
        uint32_t duty_chng_end_ch4_int_ena:1;
        /** duty_chng_end_ch5_int_ena : R/W; bitpos: [9]; default: 0;
         *  The interrupt enable bit for the LEDC_DUTY_CHNG_END_CH5_INT interrupt.
         */
        uint32_t duty_chng_end_ch5_int_ena:1;
        uint32_t reserved_10:2;
        /** ovf_cnt_ch0_int_ena : R/W; bitpos: [12]; default: 0;
         *  The interrupt enable bit for the LEDC_OVF_CNT_CH0_INT interrupt.
         */
        uint32_t ovf_cnt_ch0_int_ena:1;
        /** ovf_cnt_ch1_int_ena : R/W; bitpos: [13]; default: 0;
         *  The interrupt enable bit for the LEDC_OVF_CNT_CH1_INT interrupt.
         */
        uint32_t ovf_cnt_ch1_int_ena:1;
        /** ovf_cnt_ch2_int_ena : R/W; bitpos: [14]; default: 0;
         *  The interrupt enable bit for the LEDC_OVF_CNT_CH2_INT interrupt.
         */
        uint32_t ovf_cnt_ch2_int_ena:1;
        /** ovf_cnt_ch3_int_ena : R/W; bitpos: [15]; default: 0;
         *  The interrupt enable bit for the LEDC_OVF_CNT_CH3_INT interrupt.
         */
        uint32_t ovf_cnt_ch3_int_ena:1;
        /** ovf_cnt_ch4_int_ena : R/W; bitpos: [16]; default: 0;
         *  The interrupt enable bit for the LEDC_OVF_CNT_CH4_INT interrupt.
         */
        uint32_t ovf_cnt_ch4_int_ena:1;
        /** ovf_cnt_ch5_int_ena : R/W; bitpos: [17]; default: 0;
         *  The interrupt enable bit for the LEDC_OVF_CNT_CH5_INT interrupt.
         */
        uint32_t ovf_cnt_ch5_int_ena:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} ledc_int_ena_reg_t;

/** Type of int_clr register
 *  Interrupt clear bits
 */
typedef union {
    struct {
        /** timer0_ovf_int_clr : WT; bitpos: [0]; default: 0;
         *  Set this bit to clear the LEDC_TIMER0_OVF_INT interrupt.
         */
        uint32_t timer0_ovf_int_clr:1;
        /** timer1_ovf_int_clr : WT; bitpos: [1]; default: 0;
         *  Set this bit to clear the LEDC_TIMER1_OVF_INT interrupt.
         */
        uint32_t timer1_ovf_int_clr:1;
        /** timer2_ovf_int_clr : WT; bitpos: [2]; default: 0;
         *  Set this bit to clear the LEDC_TIMER2_OVF_INT interrupt.
         */
        uint32_t timer2_ovf_int_clr:1;
        /** timer3_ovf_int_clr : WT; bitpos: [3]; default: 0;
         *  Set this bit to clear the LEDC_TIMER3_OVF_INT interrupt.
         */
        uint32_t timer3_ovf_int_clr:1;
        /** duty_chng_end_ch0_int_clr : WT; bitpos: [4]; default: 0;
         *  Set this bit to clear the LEDC_DUTY_CHNG_END_CH0_INT interrupt.
         */
        uint32_t duty_chng_end_ch0_int_clr:1;
        /** duty_chng_end_ch1_int_clr : WT; bitpos: [5]; default: 0;
         *  Set this bit to clear the LEDC_DUTY_CHNG_END_CH1_INT interrupt.
         */
        uint32_t duty_chng_end_ch1_int_clr:1;
        /** duty_chng_end_ch2_int_clr : WT; bitpos: [6]; default: 0;
         *  Set this bit to clear the LEDC_DUTY_CHNG_END_CH2_INT interrupt.
         */
        uint32_t duty_chng_end_ch2_int_clr:1;
        /** duty_chng_end_ch3_int_clr : WT; bitpos: [7]; default: 0;
         *  Set this bit to clear the LEDC_DUTY_CHNG_END_CH3_INT interrupt.
         */
        uint32_t duty_chng_end_ch3_int_clr:1;
        /** duty_chng_end_ch4_int_clr : WT; bitpos: [8]; default: 0;
         *  Set this bit to clear the LEDC_DUTY_CHNG_END_CH4_INT interrupt.
         */
        uint32_t duty_chng_end_ch4_int_clr:1;
        /** duty_chng_end_ch5_int_clr : WT; bitpos: [9]; default: 0;
         *  Set this bit to clear the LEDC_DUTY_CHNG_END_CH5_INT interrupt.
         */
        uint32_t duty_chng_end_ch5_int_clr:1;
        uint32_t reserved_10:2;
        /** ovf_cnt_ch0_int_clr : WT; bitpos: [12]; default: 0;
         *  Set this bit to clear the LEDC_OVF_CNT_CH0_INT interrupt.
         */
        uint32_t ovf_cnt_ch0_int_clr:1;
        /** ovf_cnt_ch1_int_clr : WT; bitpos: [13]; default: 0;
         *  Set this bit to clear the LEDC_OVF_CNT_CH1_INT interrupt.
         */
        uint32_t ovf_cnt_ch1_int_clr:1;
        /** ovf_cnt_ch2_int_clr : WT; bitpos: [14]; default: 0;
         *  Set this bit to clear the LEDC_OVF_CNT_CH2_INT interrupt.
         */
        uint32_t ovf_cnt_ch2_int_clr:1;
        /** ovf_cnt_ch3_int_clr : WT; bitpos: [15]; default: 0;
         *  Set this bit to clear the LEDC_OVF_CNT_CH3_INT interrupt.
         */
        uint32_t ovf_cnt_ch3_int_clr:1;
        /** ovf_cnt_ch4_int_clr : WT; bitpos: [16]; default: 0;
         *  Set this bit to clear the LEDC_OVF_CNT_CH4_INT interrupt.
         */
        uint32_t ovf_cnt_ch4_int_clr:1;
        /** ovf_cnt_ch5_int_clr : WT; bitpos: [17]; default: 0;
         *  Set this bit to clear the LEDC_OVF_CNT_CH5_INT interrupt.
         */
        uint32_t ovf_cnt_ch5_int_clr:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} ledc_int_clr_reg_t;


/** Group: Gamma RAM Register */
/** Type of chn_gamma_wr register
 *  Ledc chn gamma ram write register.
 */
typedef union {
    struct {
        /** gamma_duty_inc : R/W; bitpos: [0]; default: 0;
         *  Ledc chn gamma duty inc of current ram write address.This register is used to
         *  increase or decrease the duty of output signal on channel n.
         *
         *  1: Increase  0: Decrease.
         */
        uint32_t gamma_duty_inc:1;
        /** gamma_duty_cycle : R/W; bitpos: [10:1]; default: 0;
         *  Ledc chn gamma duty cycle of current ram write address.The duty will change every
         *  LEDC_CHn_GAMMA_DUTY_CYCLE on channel n.
         */
        uint32_t gamma_duty_cycle:10;
        /** gamma_scale : R/W; bitpos: [20:11]; default: 0;
         *  Ledc chn gamma scale of current ram write address.This register is used to
         *  configure the changing step scale of duty on channel n.
         */
        uint32_t gamma_scale:10;
        /** gamma_duty_num : R/W; bitpos: [30:21]; default: 0;
         *  Ledc chn gamma duty num of current ram write address.This register is used to
         *  control the number of times the duty cycle will be changed.
         */
        uint32_t gamma_duty_num:10;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} ledc_chn_gamma_wr_reg_t;

/** Type of chn_gamma_wr_addr register
 *  Ledc chn gamma ram write address register.
 */
typedef union {
    struct {
        /** gamma_wr_addr : R/W; bitpos: [3:0]; default: 0;
         *  Ledc chn gamma ram write address.
         */
        uint32_t gamma_wr_addr:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} ledc_chn_gamma_wr_addr_reg_t;

/** Type of chn_gamma_rd_addr register
 *  Ledc chn gamma ram read address register.
 */
typedef union {
    struct {
        /** gamma_rd_addr : R/W; bitpos: [3:0]; default: 0;
         *  Ledc chn gamma ram read address.
         */
        uint32_t gamma_rd_addr:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} ledc_chn_gamma_rd_addr_reg_t;

/** Type of chn_gamma_rd_data register
 *  Ledc chn gamma ram read data register.
 */
typedef union {
    struct {
        /** gamma_rd_data : RO; bitpos: [30:0]; default: 0;
         *  Ledc chn gamma ram read data.
         */
        uint32_t gamma_rd_data:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} ledc_chn_gamma_rd_data_reg_t;


/** Group: Gamma Config Register */
/** Type of chn_gamma_conf register
 *  Ledc chn gamma config register.
 */
typedef union {
    struct {
        /** gamma_entry_num : R/W; bitpos: [4:0]; default: 0;
         *  Ledc chn gamma entry num.
         */
        uint32_t gamma_entry_num:5;
        /** gamma_pause : WT; bitpos: [5]; default: 0;
         *  Ledc chn gamma pause, write 1 to pause.
         */
        uint32_t gamma_pause:1;
        /** gamma_resume : WT; bitpos: [6]; default: 0;
         *  Ledc chn gamma resume, write 1 to resume.
         */
        uint32_t gamma_resume:1;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} ledc_chn_gamma_conf_reg_t;


