espressif/esp-idf/components/soc/esp32h21/register/soc/ledc_struct.h
/** Group: Version Register */
/** Type of date register
 *  Version control register
 */
typedef union {
    struct {
        /** ledc_date : R/W; bitpos: [27:0]; default: 34672976;
         *  This is the version control register.
         */
        uint32_t ledc_date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} ledc_date_reg_t;


typedef struct {
    volatile ledc_chn_conf0_reg_t conf0;
    volatile ledc_chn_hpoint_reg_t hpoint;
    volatile ledc_chn_duty_reg_t duty;
    volatile ledc_chn_conf1_reg_t conf1;
    volatile ledc_chn_duty_r_reg_t duty_rd;
} ledc_chn_reg_t;

typedef struct {
    volatile ledc_chn_reg_t channel[6];
} ledc_ch_group_reg_t;

typedef struct {
    volatile ledc_timerx_conf_reg_t conf;
    volatile ledc_timerx_value_reg_t value;
} ledc_timerx_reg_t;

typedef struct {
    volatile ledc_timerx_reg_t timer[4];
} ledc_timer_group_reg_t;

typedef struct {
    volatile ledc_chn_gamma_wr_reg_t wr;
    volatile ledc_chn_gamma_wr_addr_reg_t wr_addr;
    volatile ledc_chn_gamma_rd_addr_reg_t rd_addr;
    volatile ledc_chn_gamma_rd_data_reg_t rd_data;
} ledc_chn_gamma_reg_t;

typedef struct {
    volatile ledc_chn_gamma_reg_t channel[6];
} ledc_ch_gamma_group_reg_t;

typedef struct {
    volatile ledc_chn_gamma_conf_reg_t gamma_conf[6];
} ledc_ch_gamma_conf_group_reg_t;

typedef struct {
    volatile ledc_timerx_cmp_reg_t cmp[4];
} ledc_timer_cmp_group_reg_t;

typedef struct {
    volatile ledc_timerx_cnt_cap_reg_t cnt_cap[4];
} ledc_timer_cnt_cap_group_reg_t;


typedef struct ledc_dev_t {
    volatile ledc_ch_group_reg_t channel_group[1];
    uint32_t reserved_078[10];
    volatile ledc_timer_group_reg_t timer_group[1];
    volatile ledc_int_raw_reg_t int_raw;
    volatile ledc_int_st_reg_t int_st;
    volatile ledc_int_ena_reg_t int_ena;
    volatile ledc_int_clr_reg_t int_clr;
    uint32_t reserved_0d0[12];
    volatile ledc_ch_gamma_group_reg_t channel_gamma_group[1];
    uint32_t reserved_160[8];
    volatile ledc_ch_gamma_conf_group_reg_t channel_gamma_conf_group[1];
    uint32_t reserved_198[2];
    volatile ledc_evt_task_en0_reg_t evt_task_en0;
    volatile ledc_evt_task_en1_reg_t evt_task_en1;
    volatile ledc_evt_task_en2_reg_t evt_task_en2;
    uint32_t reserved_1ac;
    volatile ledc_timer_cmp_group_reg_t timer_cmp_group[1];
    volatile ledc_timer_cnt_cap_group_reg_t timer_cnt_cap_group[1];
    uint32_t reserved_1d0[8];
    volatile ledc_conf_reg_t conf;
    uint32_t reserved_1f4[2];
    volatile ledc_date_reg_t date;
} ledc_dev_t;

extern ledc_dev_t LEDC;

#ifndef __cplusplus
_Static_assert(sizeof(ledc_dev_t) == 0x200, "Invalid size of ledc_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
